app/Controllers/BiodataKtp.php

INSERT INTO `biodata_ktp` (`ktp_nomor`, `ktp_nama`, `ktp_tempat_lahir`, `ktp_tanggal_lahir`, `ktp_kelamin`, `ktp_alamat`, `ktp_rt`, `ktp_rw`, `ktp_alamatid`, `ktp_hp`, `ktp_email`, `ktp_foto`) VALUES ('1808051201920006', 'Sutino', 'Bumi Agung Wates', '1992-01-12', 'Pria', 'Moro Seneng', '004', '002', '40098', '085810100913', 'sutino1201@gmail.com', '')
---

                $modelBiodata = new Modelbiodataktp();

                $modelBiodata->insert([
                    'ktp_nomor'         => $ktp_nomor,
                    'ktp_nama'          => $ktp_nama,
                    'ktp_tempat_lahir'  => $ktp_tempat_lahir,
                    'ktp_tanggal_lahir' => $ktp_tanggal_lahir,
                    'ktp_kelamin'       => $ktp_kelamin,
                    'ktp_alamat'        => $ktp_alamat,
                    'ktp_rt'            => $ktp_rt,
                    'ktp_rw'            => $ktp_rw,
                    'ktp_alamatid'      => $ktp_alamatid,
                    'ktp_hp'            => $ktp_hp,
                    'ktp_email'         => $ktp_email,
                    'ktp_foto'          => ''
                ]);