app/Controllers/Main.php

    public function index()
    {
        $modelusers = new ModelUsers();
        $cekUser = $modelusers->find(session()->iduser);
---
SELECT *
FROM `users`
WHERE `users`.`userid` = 'admin'