app/Controllers/Pemakaian.php

SELECT *
FROM `barang`
WHERE `barang`.`brgkode` = '3'
---
    function ambilDataBarang()
    {
        if ($this->request->isAJAX()) {
            $pmkbrgkode = $this->request->getPost('pmkbrgkode');

            $modelBarang    = new ModelBarang();
            $cekData        = $modelBarang->find($pmkbrgkode);