app/Controllers/Pembelian.php

SELECT *
FROM `suplier`
WHERE `suplier`.`supid` = '0'
---
    public function cetakFaktur($faktur)
    {
        $ModelPembelian = new ModelPembelian();
        $modelDetail = new ModelDetailPembelian();
        $ModelSuplier = new ModelSuplier();

        $cekData = $ModelPembelian->find($faktur);
        $dataSuplier = $ModelSuplier->find($cekData['idsup']);