app/Controllers/Pengembalian.php

SELECT *
FROM `barang`
WHERE `barang`.`brgkode` = '3'
---
    function ambilDataBarang()
    {
        if ($this->request->isAJAX()) {
            $pgmbrgkode = $this->request->getPost('pgmbrgkode');

            $modelBarang    = new ModelBarang();
            $cekData        = $modelBarang->find($pgmbrgkode);