app/Controllers/Profil.php

SELECT *
FROM `users`
WHERE `users`.`userid` = 'admin'
---
    public function index($admin)
    {
        //ambil tabel user
        $modelUser = new ModelUsers();
        $rowUser = $modelUser->find($admin);