app/Controllers/Psikotest.php

INSERT INTO `psikotest` (`testktp`, `testtanggal`, `testpertid`, `testkuncijawaban`, `testjawab`, `teststatus`) VALUES ('3173066701940004', '2022-08-16', '1', 'A', 'B', '')
---
    public function simpan()
    {
        if ($this->request->isAJAX()) {
            $nomorktp       = $this->request->getVar('nomorktp');
            $tanggal        = $this->request->getVar('tanggal');
            $soal           = $this->request->getVar('soal');
            $kuncijawaban   = $this->request->getVar('kuncijawaban');
            $jawab          = $this->request->getVar('jawab');

            $jmldata = count($nomorktp);

            $modelPsikotest = new ModelPsikotest();
            for ($i = 0; $i < $jmldata; $i++) {
                $modelPsikotest->insert([
                    'testktp'           => $nomorktp[$i],
                    'testtanggal'       => $tanggal[$i],
                    'testpertid'        => $soal[$i],
                    'testkuncijawaban'  => $kuncijawaban[$i],
                    'testjawab'         => $jawab[$i],
                    'teststatus'        => ''
                ]);