app/Controllers/Psikotest.php

    public function mulaitest($id)
    {
        $modelSoal  = new ModelSoal();
        $cekDataSoal = $modelSoal->findAll();
---
SELECT *
FROM `soal`