app/Controllers/Users.php


                    $modelUser = new Modelusers();

                    $cekKtp = $modelUser->cariKtp($userktp)->getRowArray();
---
SELECT *
FROM `users`
WHERE `users`.`userid` = '3173062807740004'

                                ]
                            ];
                        } else {
                            $modelUser->insert([
                                'userid'            => $userid,
                                'usernama'          => $usernama,
                                'userktp'           => $userktp,
                                'useremail'         => $useremail,
                                'userpassword'      => password_hash($userpassword, PASSWORD_BCRYPT),
                                'userlevelid'       => $userlevelid
                            ]);
---
INSERT INTO `users` (`userid`, `usernama`, `userktp`, `useremail`, `userpassword`, `userlevelid`) VALUES ('3173062807740004', 'Imal Maliki', '3173062807740004', 'imal2898@yahoo.com', '$2y$10$xDvmz4yA6LZY2xhBR6aFnOoCL1sXqpp3DqoB9AyuSFNgwVeEHuhuW', '2')