app/Models/ModelDetailPembelian.php

SELECT *
FROM `detail_barangmasuk`
JOIN `barang` ON `detbrgkode`=`brgkode`
JOIN `satuan` ON `brgsatid`=`satid`
WHERE `detfaktur` = '2807220001'
---
    public function tampilDataDetail($nofaktur)
    {
        return $this->table('detail_barangmasuk')->join('barang', 'detbrgkode=brgkode')
            ->join('satuan', 'brgsatid=satid')
            ->where('detfaktur', $nofaktur)->get();