app/Models/ModelPsikotest.php

    public function dataTest($nomorktp)
    {
        return $this->table('psikotest')->where('testktp', $nomorktp)->get();
---
SELECT *
FROM `psikotest`
WHERE `testktp` = '3173066701940004'