app/Models/ModelPengembalianTemp.php

SELECT *
FROM `temp_pengembalian`
JOIN `barang` ON `detpgmbrgkode`=`brgkode`
WHERE `detpgmnomor` = '2811220001'
---
    public function tampilDataTemp($detpgmnomor)
    {
        return $this->table('temp_pengembalian')->join('barang', 'detpgmbrgkode=brgkode')->where('detpgmnomor', $detpgmnomor)->get();