app/Models/ModelPengembalianPagination.php

    public function count_all($tglawal, $tglakhir)
    {
        if ($tglawal == '' && $tglakhir == '') {
            $tbl_storage = $this->db->table($this->table)->join('biodata_ktp', 'pgmoleh=ktp_nomor', 'left');
        } else {
            $tbl_storage = $this->db->table($this->table)->join('biodata_ktp', 'pgmoleh=ktp_nomor', 'left')->where('pgmtanggal >=', $tglawal)->where('pgmtanggal <=', $tglakhir);
        }

        return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pengembalian`
LEFT JOIN `biodata_ktp` ON `pgmoleh`=`ktp_nomor`