app/Models/ModelPengembalian.php

SELECT max(pgmnomor) as pgmnomor
FROM `pengembalian`
WHERE `pgmtanggal` = '2022-11-28'
---
    public function noKembali($tanggalSekarang)
    {
        return $this->table('pengembalian')->select('max(pgmnomor) as pgmnomor')->where('pgmtanggal', $tanggalSekarang)->get();