app/Models/ModelPemakaianTemp.php

SELECT *
FROM `temp_pemakaian`
JOIN `barang` ON `pmkbrgkode`=`brgkode`
WHERE `pmknomor` = '1207230002'
---
    public function tampilDataTemp($pmknomor)
    {
        return $this->table('temp_pemakaian')->join('barang', 'pmkbrgkode=brgkode')->where('pmknomor', $pmknomor)->get();