app/Models/ModelLowonganApplyPagination.php

    function count_filtered()
    {
        $this->_get_datatables_query();
        return $this->dt->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `lowongan_apply`

    public function count_all()
    {
        $tbl_storage = $this->db->table($this->table)->join('biodata_ktp', 'ktp_nomor=applyktp')->join('lowongan', 'lowonganid=applylowid');
        return $tbl_storage->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `lowongan_apply`
JOIN `biodata_ktp` ON `ktp_nomor`=`applyktp`