app/Models/ModelHrBagianPagination.php

SELECT *
FROM `hr_bagian`
ORDER BY `bagianid` ASC
 LIMIT 10
---
    function get_datatables()
    {
        $this->_get_datatables_query();
        if ($this->request->getPost('length') != -1)
            $this->dt->limit($this->request->getPost('length'), $this->request->getPost('start'));
        $query = $this->dt->get();

SELECT COUNT(*) AS `numrows`
FROM `hr_bagian`
---
    function count_filtered()
    {
        $this->_get_datatables_query();
        return $this->dt->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `hr_bagian`
---
    public function count_all()
    {
        $tbl_storage = $this->db->table($this->table);
        return $tbl_storage->countAllResults();