app/Models/ModelTempPembelian.php

SELECT *
FROM `temp_barangmasuk`
JOIN `barang` ON `detbrgkode`=`brgkode`
WHERE `detfaktur` = '2907220002'
---
    public function tampilDataTemp($nofaktur)
    {
        return $this->table('temp_barangmasuk')->join('barang', 'detbrgkode=brgkode')->where('detfaktur', $nofaktur)->get();