app/Models/ModelLowongan.php

    public function cariData($status)
    {
        return $this->table('lowongan')->where('lowonganstatus', $status)->get();
---
SELECT *
FROM `lowongan`
WHERE `lowonganstatus` = 'Aktif'