app/Models/ModelUsersPagination.php

SELECT COUNT(*) AS `numrows`
FROM `users`
---
    function count_filtered()
    {
        $this->_get_datatables_query();
        return $this->dt->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function count_all()
    {
        $tbl_storage = $this->db->table($this->table);
        return $tbl_storage->countAllResults();