app/Models/ModelBarangPagination.php

SELECT COUNT(*) AS `numrows`
FROM `barang`
---
    function count_filtered()
    {
        $this->_get_datatables_query();
        return $this->dt->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `barang`
LEFT JOIN `kategori` ON `brgkatid`=`katid`
LEFT JOIN `subkategori` ON `brgsubkatid`=`subkatid`
LEFT JOIN `satuan` ON `brgsatid`=`satid`
---
    public function count_all()
    {
        $tbl_storage = $this->db->table($this->table)->join('kategori', 'brgkatid=katid', 'left')->join('subkategori', 'brgsubkatid=subkatid', 'left')->join('satuan', 'brgsatid=satid', 'left');
        return $tbl_storage->countAllResults();