app/Models/ModelPenerimaan.php

    public function noTtb($tanggalSekarang)
    {
        return $this->table('tanda_terimabarang')->select('max(ttbnomor) as nottb')->where('ttbtanggal', $tanggalSekarang)->get();
---
SELECT max(ttbnomor) as nottb
FROM `tanda_terimabarang`
WHERE `ttbtanggal` = '2022-12-09'

    public function tampilDataPenerimaan($nofaktur)
    {
        return $this->table('tanda_terimabarang')->join('barang', 'ttbbrgkode=brgkode')
            ->where('ttbfaktur', $nofaktur)->get();
---
SELECT *
FROM `tanda_terimabarang`
JOIN `barang` ON `ttbbrgkode`=`brgkode`
WHERE `ttbfaktur` = '2807220001'