app/Models/ModelUsers.php

    public function cariKtp($userktp)
    {
        return $this->table('users')->Where('userktp', $userktp)->get();
---
SELECT *
FROM `users`
WHERE `userktp` = '3173062807740004'

    public function cariEmail($useremail)
    {
        return $this->table('users')->Where('useremail', $useremail)->get();
---
SELECT *
FROM `users`
WHERE `useremail` = 'imal2898@yahoo.com'