app/Models/ModelLowonganApply.php

    function cariData($userktp)
    {
        $query = $this->table('lowongan_apply')->getWhere([
            'applyktp' => $userktp
        ]);
---
SELECT *
FROM `lowongan_apply`
WHERE `applyktp` = '3173066701940004'